
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.dnsrecord_main will be created
  + resource "cloudflare_record" "dnsrecord_main" {
      + allow_overwrite = true
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "vault.zenpresscloudmail.xyz"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (known after apply)
    }

  # cloudflare_ruleset.ruleset_cache will be created
  + resource "cloudflare_ruleset" "ruleset_cache" {
      + description = (known after apply)
      + id          = (known after apply)
      + kind        = "zone"
      + name        = "disable_cache_everything"
      + phase       = "http_request_cache_settings"
      + zone_id     = (known after apply)

      + rules {
          + action      = "set_cache_settings"
          + description = "Soft disable cache (Terraform-safe)"
          + enabled     = true
          + expression  = "true"
          + id          = (known after apply)
          + ref         = (known after apply)

          + action_parameters {
              + cache = false
            }
        }
    }

  # cloudflare_ruleset.ruleset_waf will be created
  + resource "cloudflare_ruleset" "ruleset_waf" {
      + description = (known after apply)
      + id          = (known after apply)
      + kind        = "zone"
      + name        = "country-access-control"
      + phase       = "http_request_firewall_custom"
      + zone_id     = (known after apply)

      + rules {
          + action      = "block"
          + description = "Block all non-allowed countries"
          + enabled     = true
          + expression  = "not ((ip.geoip.country eq \"ES\"))"
          + id          = (known after apply)
          + ref         = (known after apply)
        }
    }

  # cloudflare_zone.zone_main will be created
  + resource "cloudflare_zone" "zone_main" {
      + account_id          = "8c1b1fa2b3c7fdeeeee448c28b7342d0"
      + id                  = (known after apply)
      + meta                = (known after apply)
      + name_servers        = (known after apply)
      + paused              = false
      + plan                = (known after apply)
      + status              = (known after apply)
      + type                = "full"
      + vanity_name_servers = (known after apply)
      + verification_key    = (known after apply)
      + zone                = "zenpresscloudmail.xyz"
    }

  # cloudflare_zone_settings_override.zonesettings_main will be created
  + resource "cloudflare_zone_settings_override" "zonesettings_main" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + readonly_settings        = (known after apply)
      + zone_id                  = (known after apply)
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = (known after apply)
          + always_use_https            = "on"
          + automatic_https_rewrites    = "on"
          + binary_ast                  = (known after apply)
          + brotli                      = (known after apply)
          + browser_cache_ttl           = (known after apply)
          + browser_check               = (known after apply)
          + cache_level                 = (known after apply)
          + challenge_ttl               = (known after apply)
          + ciphers                     = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = (known after apply)
          + early_hints                 = (known after apply)
          + email_obfuscation           = (known after apply)
          + filter_logs_to_cloudflare   = (known after apply)
          + fonts                       = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = (known after apply)
          + http2                       = (known after apply)
          + http3                       = (known after apply)
          + image_resizing              = (known after apply)
          + ip_geolocation              = (known after apply)
          + ipv6                        = (known after apply)
          + log_to_cloudflare           = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = "1.2"
          + mirage                      = (known after apply)
          + opportunistic_encryption    = (known after apply)
          + opportunistic_onion         = (known after apply)
          + orange_to_orange            = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + origin_max_http_version     = (known after apply)
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = (known after apply)
          + proxy_read_timeout          = (known after apply)
          + pseudo_ipv4                 = (known after apply)
          + replace_insecure_js         = (known after apply)
          + response_buffering          = (known after apply)
          + rocket_loader               = (known after apply)
          + security_level              = (known after apply)
          + server_side_exclude         = (known after apply)
          + sort_query_string_for_cache = (known after apply)
          + speed_brain                 = (known after apply)
          + ssl                         = "full"
          + ssl_automatic_mode          = (known after apply)
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = (known after apply)
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + universal_ssl               = (known after apply)
          + visitor_ip                  = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = (known after apply)
          + zero_rtt                    = (known after apply)

          + aegis (known after apply)

          + minify (known after apply)

          + mobile_redirect (known after apply)

          + nel (known after apply)

          + security_header (known after apply)
        }
    }

  # google_compute_backend_service.backend_main will be destroyed
  # (because google_compute_backend_service.backend_main is not in configuration)
  - resource "google_compute_backend_service" "backend_main" {
      - affinity_cookie_ttl_sec         = 0 -> null
      - connection_draining_timeout_sec = 10 -> null
      - creation_timestamp              = "2025-11-25T02:59:29.152-08:00" -> null
      - custom_request_headers          = [] -> null
      - custom_response_headers         = [] -> null
      - enable_cdn                      = false -> null
      - fingerprint                     = "984c3s47z2s=" -> null
      - generated_id                    = 2897115388813259518 -> null
      - health_checks                   = [
          - "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/healthChecks/zenpresscloudmail-vault-healthcheck-https",
        ] -> null
      - id                              = "projects/semiotic-vial-479310-e8/global/backendServices/zenpresscloudmail-vault-backend-main" -> null
      - load_balancing_scheme           = "EXTERNAL" -> null
      - name                            = "zenpresscloudmail-vault-backend-main" -> null
      - port_name                       = "https" -> null
      - project                         = "semiotic-vial-479310-e8" -> null
      - protocol                        = "HTTPS" -> null
      - security_policy                 = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/securityPolicies/zenpresscloudmail-vault-cloudarmor-main" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/backendServices/zenpresscloudmail-vault-backend-main" -> null
      - session_affinity                = "NONE" -> null
      - timeout_sec                     = 30 -> null
        # (4 unchanged attributes hidden)

      - backend {
          - balancing_mode               = "UTILIZATION" -> null
          - capacity_scaler              = 1 -> null
          - group                        = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/zones/europe-southwest1-a/instanceGroups/zenpresscloudmail-vault-instancegroup-main" -> null
          - max_connections              = 0 -> null
          - max_connections_per_endpoint = 0 -> null
          - max_connections_per_instance = 0 -> null
          - max_rate                     = 0 -> null
          - max_rate_per_endpoint        = 0 -> null
          - max_rate_per_instance        = 0 -> null
          - max_utilization              = 0 -> null
            # (1 unchanged attribute hidden)
        }
    }

  # google_compute_firewall.fw_cf will be created
  + resource "google_compute_firewall" "fw_cf" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "zenpresscloudmail-vault-firewall-cf"
      + network            = "default"
      + priority           = 1000
      + project            = "semiotic-vial-479310-e8"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "103.21.244.0/22",
          + "103.22.200.0/22",
          + "103.31.4.0/22",
          + "104.16.0.0/13",
          + "104.24.0.0/14",
          + "108.162.192.0/18",
          + "131.0.72.0/22",
          + "141.101.64.0/18",
          + "162.158.0.0/15",
          + "172.64.0.0/13",
          + "173.245.48.0/20",
          + "188.114.96.0/20",
          + "190.93.240.0/20",
          + "197.234.240.0/22",
          + "198.41.128.0/17",
        ]
      + target_tags        = [
          + "zenpresscloudmail-vault-instance-main",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.fw_lb will be destroyed
  # (because google_compute_firewall.fw_lb is not in configuration)
  - resource "google_compute_firewall" "fw_lb" {
      - creation_timestamp      = "2025-11-25T02:59:16.607-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/semiotic-vial-479310-e8/global/firewalls/zenpresscloudmail-vault-firewall-lb" -> null
      - name                    = "zenpresscloudmail-vault-firewall-lb" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/networks/default" -> null
      - priority                = 1000 -> null
      - project                 = "semiotic-vial-479310-e8" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/firewalls/zenpresscloudmail-vault-firewall-lb" -> null
      - source_ranges           = [
          - "130.211.0.0/22",
          - "35.191.0.0/16",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [
          - "zenpresscloudmail-vault-instance-main",
        ] -> null
        # (1 unchanged attribute hidden)

      - allow {
          - ports    = [
              - "80",
              - "443",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # google_compute_global_address.lb_ip will be destroyed
  # (because google_compute_global_address.lb_ip is not in configuration)
  - resource "google_compute_global_address" "lb_ip" {
      - address            = "136.110.157.37" -> null
      - address_type       = "EXTERNAL" -> null
      - creation_timestamp = "2025-11-25T02:58:51.270-08:00" -> null
      - id                 = "projects/semiotic-vial-479310-e8/global/addresses/zenpresscloudmail-vault-lbip-main" -> null
      - name               = "zenpresscloudmail-vault-lbip-main" -> null
      - prefix_length      = 0 -> null
      - project            = "semiotic-vial-479310-e8" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/addresses/zenpresscloudmail-vault-lbip-main" -> null
        # (4 unchanged attributes hidden)
    }

  # google_compute_global_forwarding_rule.lb_rule will be destroyed
  # (because google_compute_global_forwarding_rule.lb_rule is not in configuration)
  - resource "google_compute_global_forwarding_rule" "lb_rule" {
      - id                    = "projects/semiotic-vial-479310-e8/global/forwardingRules/zenpresscloudmail-vault-lbrule-main" -> null
      - ip_address            = "136.110.157.37" -> null
      - ip_protocol           = "TCP" -> null
      - label_fingerprint     = "42WmSpB8rSM=" -> null
      - labels                = {} -> null
      - load_balancing_scheme = "EXTERNAL" -> null
      - name                  = "zenpresscloudmail-vault-lbrule-main" -> null
      - port_range            = "443-443" -> null
      - project               = "semiotic-vial-479310-e8" -> null
      - self_link             = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/forwardingRules/zenpresscloudmail-vault-lbrule-main" -> null
      - source_ip_ranges      = [] -> null
      - target                = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/targetHttpsProxies/zenpresscloudmail-vault-lbtarget-main" -> null
        # (7 unchanged attributes hidden)
    }

  # google_compute_health_check.healthcheck_https will be destroyed
  # (because google_compute_health_check.healthcheck_https is not in configuration)
  - resource "google_compute_health_check" "healthcheck_https" {
      - check_interval_sec  = 30 -> null
      - creation_timestamp  = "2025-11-25T02:58:51.196-08:00" -> null
      - healthy_threshold   = 2 -> null
      - id                  = "projects/semiotic-vial-479310-e8/global/healthChecks/zenpresscloudmail-vault-healthcheck-https" -> null
      - name                = "zenpresscloudmail-vault-healthcheck-https" -> null
      - project             = "semiotic-vial-479310-e8" -> null
      - self_link           = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/healthChecks/zenpresscloudmail-vault-healthcheck-https" -> null
      - timeout_sec         = 10 -> null
      - type                = "TCP" -> null
      - unhealthy_threshold = 3 -> null
        # (1 unchanged attribute hidden)

      - log_config {
          - enable = false -> null
        }

      - tcp_health_check {
          - port               = 443 -> null
          - proxy_header       = "NONE" -> null
            # (4 unchanged attributes hidden)
        }
    }

  # google_compute_instance.instance_bitwarden will be destroyed
  # (because google_compute_instance.instance_bitwarden is not in configuration)
  - resource "google_compute_instance" "instance_bitwarden" {
      - allow_stopping_for_update = true -> null
      - can_ip_forward            = false -> null
      - cpu_platform              = "Intel Broadwell" -> null
      - current_status            = "RUNNING" -> null
      - deletion_protection       = false -> null
      - enable_display            = false -> null
      - guest_accelerator         = [] -> null
      - id                        = "projects/semiotic-vial-479310-e8/zones/europe-southwest1-a/instances/zenpresscloudmail-vault-instance-main" -> null
      - instance_id               = "798779661466744066" -> null
      - label_fingerprint         = "54ffHQLiMnU=" -> null
      - labels                    = {
          - "goog-ec-src" = "vm_add-gcloud"
        } -> null
      - machine_type              = "e2-medium" -> null
      - metadata                  = {
          - "enable-osconfig" = "TRUE"
          - "ssh-keys"        = <<-EOT
                zenpresscloudmail:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBByuvkSHb82mMpTIq+1ooJiDboinvp93j2WEEMR2L/yTYSjGAJdXGVb06ISyOQrlUs7dv3vAPMsvZorhMqmBBTU= google-ssh {"userName":"zenpresscloudmail@gmail.com","expireOn":"2025-11-25T11:36:45+0000"}
                zenpresscloudmail:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQClpEp8s5YVmd5zIOm1O612GnaejBj6S91x9ZRfe36Dve9KjFD4kh76ezNKZGk5jLLxazQh7EAk3JgPPe3WKL0kbgzvFOX+QORfQioIXt3NB1GwRRVPAmoHUhPogKsdkgoWK0BzVLyTSiYVCWQ55g+09pLsFPmd/bU67pfLXPtBxiTMQH8vlQ71ilolDbpb6yKt4XWPFYA8zRl73NK0h2dpRyNfuN0wdhzc1PVDeqZAQKuTYDFMGz8JVaBpbHVap2n2ur6oesw1XilAbX1klClQvhXGhHdYVoRWBj1eSoIx029Dj1R66Zou1UuiJ73boRSViqEMD8U3giIv0HOpX+jb google-ssh {"userName":"zenpresscloudmail@gmail.com","expireOn":"2025-11-25T11:36:57+0000"}
            EOT
        } -> null
      - metadata_fingerprint      = "kqusb69R26I=" -> null
      - name                      = "zenpresscloudmail-vault-instance-main" -> null
      - project                   = "semiotic-vial-479310-e8" -> null
      - resource_policies         = [] -> null
      - self_link                 = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/zones/europe-southwest1-a/instances/zenpresscloudmail-vault-instance-main" -> null
      - tags                      = [
          - "zenpresscloudmail-vault-instance-main",
        ] -> null
      - tags_fingerprint          = "-QT9MmF0nQQ=" -> null
      - zone                      = "europe-southwest1-a" -> null
        # (3 unchanged attributes hidden)

      - boot_disk {
          - auto_delete                = false -> null
          - device_name                = "zenpresscloudmail-vault-disk-main" -> null
          - mode                       = "READ_WRITE" -> null
          - source                     = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/zones/europe-southwest1-a/disks/zenpresscloudmail-vault-instance-main" -> null
            # (3 unchanged attributes hidden)

          - initialize_params {
              - image                 = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-minimal-2404-noble-amd64-v20251002" -> null
              - labels                = {} -> null
              - resource_manager_tags = {} -> null
              - size                  = 25 -> null
              - type                  = "pd-balanced" -> null
            }
        }

      - network_interface {
          - internal_ipv6_prefix_length = 0 -> null
          - name                        = "nic0" -> null
          - network                     = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/networks/default" -> null
          - network_ip                  = "10.204.0.2" -> null
          - queue_count                 = 0 -> null
          - stack_type                  = "IPV4_ONLY" -> null
          - subnetwork                  = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/regions/europe-southwest1/subnetworks/default" -> null
          - subnetwork_project          = "semiotic-vial-479310-e8" -> null
            # (3 unchanged attributes hidden)

          - access_config {
              - nat_ip                 = "34.0.197.31" -> null
              - network_tier           = "STANDARD" -> null
                # (1 unchanged attribute hidden)
            }
        }

      - reservation_affinity {
          - type = "NO_RESERVATION" -> null
        }

      - scheduling {
          - automatic_restart           = true -> null
          - min_node_cpus               = 0 -> null
          - on_host_maintenance         = "MIGRATE" -> null
          - preemptible                 = false -> null
          - provisioning_model          = "STANDARD" -> null
            # (1 unchanged attribute hidden)
        }

      - service_account {
          - email  = "510428698120-compute@developer.gserviceaccount.com" -> null
          - scopes = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

  # google_compute_instance.instance_main will be created
  + resource "google_compute_instance" "instance_main" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + labels                    = {
          + "goog-ec-src" = "vm_add-gcloud"
        }
      + machine_type              = "e2-medium"
      + metadata                  = {
          + "enable-osconfig" = "TRUE"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "zenpresscloudmail-vault-instance-main"
      + project                   = "semiotic-vial-479310-e8"
      + self_link                 = (known after apply)
      + tags                      = [
          + "zenpresscloudmail-vault-instance-main",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "europe-southwest1-a"

      + boot_disk {
          + auto_delete                = false
          + device_name                = "zenpresscloudmail-vault-disk-main"
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/ubuntu-os-cloud/global/images/ubuntu-minimal-2404-noble-amd64-v20251002"
              + labels = (known after apply)
              + size   = 25
              + type   = "pd-balanced"
            }
        }

      + confidential_instance_config (known after apply)

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = "IPV4_ONLY"
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "STANDARD"
            }
        }

      + reservation_affinity {
          + type = "NO_RESERVATION"
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = "MIGRATE"
          + preemptible         = false
          + provisioning_model  = "STANDARD"
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }

      + shielded_instance_config {
          + enable_integrity_monitoring = true
          + enable_secure_boot          = false
          + enable_vtpm                 = true
        }
    }

  # google_compute_instance_group.instancegroup_bitwarden will be destroyed
  # (because google_compute_instance_group.instancegroup_bitwarden is not in configuration)
  - resource "google_compute_instance_group" "instancegroup_bitwarden" {
      - id          = "projects/semiotic-vial-479310-e8/zones/europe-southwest1-a/instanceGroups/zenpresscloudmail-vault-instancegroup-main" -> null
      - instances   = [
          - "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/zones/europe-southwest1-a/instances/zenpresscloudmail-vault-instance-main",
        ] -> null
      - name        = "zenpresscloudmail-vault-instancegroup-main" -> null
      - network     = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/networks/default" -> null
      - project     = "semiotic-vial-479310-e8" -> null
      - self_link   = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/zones/europe-southwest1-a/instanceGroups/zenpresscloudmail-vault-instancegroup-main" -> null
      - size        = 1 -> null
      - zone        = "europe-southwest1-a" -> null
        # (1 unchanged attribute hidden)

      - named_port {
          - name = "https" -> null
          - port = 443 -> null
        }
    }

  # google_compute_managed_ssl_certificate.ssl_main will be destroyed
  # (because google_compute_managed_ssl_certificate.ssl_main is not in configuration)
  - resource "google_compute_managed_ssl_certificate" "ssl_main" {
      - certificate_id            = 4882019436439549188 -> null
      - creation_timestamp        = "2025-11-25T02:58:51.496-08:00" -> null
      - expire_time               = "2026-02-23T02:58:54.000-08:00" -> null
      - id                        = "projects/semiotic-vial-479310-e8/global/sslCertificates/zenpresscloudmail-vault-ssl-main" -> null
      - name                      = "zenpresscloudmail-vault-ssl-main" -> null
      - project                   = "semiotic-vial-479310-e8" -> null
      - self_link                 = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/sslCertificates/zenpresscloudmail-vault-ssl-main" -> null
      - subject_alternative_names = [
          - "vault.zenpresscloudmail.xyz",
        ] -> null
      - type                      = "MANAGED" -> null
        # (1 unchanged attribute hidden)

      - managed {
          - domains = [
              - "vault.zenpresscloudmail.xyz",
            ] -> null
        }
    }

  # google_compute_security_policy.cloudarmor_main will be destroyed
  # (because google_compute_security_policy.cloudarmor_main is not in configuration)
  - resource "google_compute_security_policy" "cloudarmor_main" {
      - fingerprint = "uEHXWN85qJY=" -> null
      - id          = "projects/semiotic-vial-479310-e8/global/securityPolicies/zenpresscloudmail-vault-cloudarmor-main" -> null
      - name        = "zenpresscloudmail-vault-cloudarmor-main" -> null
      - project     = "semiotic-vial-479310-e8" -> null
      - self_link   = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/securityPolicies/zenpresscloudmail-vault-cloudarmor-main" -> null
      - type        = "CLOUD_ARMOR" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - action      = "allow" -> null
          - description = "Allow specified countries" -> null
          - preview     = false -> null
          - priority    = 1000 -> null

          - match {
                # (1 unchanged attribute hidden)

              - expr {
                  - expression = "origin.region_code == 'ES'" -> null
                }
            }
        }
      - rule {
          - action      = "deny(403)" -> null
          - description = "Default deny rule" -> null
          - preview     = false -> null
          - priority    = 2147483647 -> null

          - match {
              - versioned_expr = "SRC_IPS_V1" -> null

              - config {
                  - src_ip_ranges = [
                      - "*",
                    ] -> null
                }
            }
        }
    }

  # google_compute_target_https_proxy.lbtarget_main will be destroyed
  # (because google_compute_target_https_proxy.lbtarget_main is not in configuration)
  - resource "google_compute_target_https_proxy" "lbtarget_main" {
      - creation_timestamp          = "2025-11-25T03:00:44.372-08:00" -> null
      - http_keep_alive_timeout_sec = 0 -> null
      - id                          = "projects/semiotic-vial-479310-e8/global/targetHttpsProxies/zenpresscloudmail-vault-lbtarget-main" -> null
      - name                        = "zenpresscloudmail-vault-lbtarget-main" -> null
      - project                     = "semiotic-vial-479310-e8" -> null
      - proxy_bind                  = false -> null
      - proxy_id                    = 3885136906899960499 -> null
      - quic_override               = "NONE" -> null
      - self_link                   = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/targetHttpsProxies/zenpresscloudmail-vault-lbtarget-main" -> null
      - ssl_certificates            = [
          - "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/sslCertificates/zenpresscloudmail-vault-ssl-main",
        ] -> null
      - url_map                     = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/urlMaps/zenpresscloudmail-vault-urlmap-main" -> null
        # (4 unchanged attributes hidden)
    }

  # google_compute_url_map.urlmap_main will be destroyed
  # (because google_compute_url_map.urlmap_main is not in configuration)
  - resource "google_compute_url_map" "urlmap_main" {
      - creation_timestamp = "2025-11-25T03:00:33.023-08:00" -> null
      - default_service    = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/backendServices/zenpresscloudmail-vault-backend-main" -> null
      - fingerprint        = "nR9QU_LJXAk=" -> null
      - id                 = "projects/semiotic-vial-479310-e8/global/urlMaps/zenpresscloudmail-vault-urlmap-main" -> null
      - map_id             = 2894439881885889215 -> null
      - name               = "zenpresscloudmail-vault-urlmap-main" -> null
      - project            = "semiotic-vial-479310-e8" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/global/urlMaps/zenpresscloudmail-vault-urlmap-main" -> null
        # (1 unchanged attribute hidden)
    }

  # local_file.file_pem_ssh will be created
  + resource "local_file" "file_pem_ssh" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "/tmp/pem_ssh"
      + id                   = (known after apply)
    }

  # null_resource.run_ansible must be replaced
-/+ resource "null_resource" "run_ansible" {
      ~ id       = "524717323955325898" -> (known after apply)
      ~ triggers = { # forces replacement
          + "instance_id"   = (known after apply)
          ~ "playbook_hash" = "c61ae1b43ccd68bb8d69936fdbfb82e6c3f7ac87b3f6bb487e7186e1764330d4" -> "b8a433fd1d096f0d8a50f46cc46dbd02bc4cef813f9b72ad16fb0d8751e22d11"
        }
    }

Plan: 9 to add, 0 to change, 12 to destroy.

Changes to Outputs:
  - bitwarden_lb_ip = "136.110.157.37" -> null
